# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50”, ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

list_of_str = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

def sum_of_numbers(obj):
    try:
        numbers = obj.split(",")  # розділяємо кожен індекс списку за комою як окреме число та записуємо у numbers
        total_sum = sum(int(number) for number in numbers) # перетворюємо кожен елемент(строку) у число та рахуємо суму цих чисел
        return total_sum
    except ValueError:  # робимо тут виключення, бо літери неможливо буде перевести в int
        return "Не можу це зробити"

for index in list_of_str:
    result = sum_of_numbers(obj=index)
    print(result)
